app/Controllers/Categorias.php

    public function index()
    {
        // Para evitar error de conexión a base de datos, mostramos la vista con datos vacíos si no hay conexión.
        try {
            $model = new CategoriaModel();
            $data['categorias'] = $model->findAll();
---
SELECT *
FROM `Categoria`