app/Controllers/Materias.php

SELECT *
FROM `Materia`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `Materia`
SELECT *
FROM `Carrera`
---
    public function index()
    {
        try {
            $perPage = 10; // Número de registros por página
            $page = $this->request->getVar('page') ?? 1;
            $carreraId = $this->request->getVar('carrera_id');

            if ($carreraId) {
                $this->materiaModel->where('carrera_id', $carreraId);
            }

            $data['materias'] = $this->materiaModel->paginate($perPage, 'default', $page);
            $data['pager'] = $this->materiaModel->pager;

            $data['carreras'] = $this->carreraModel->findAll();