app/Controllers/Modalidades.php

SELECT *
FROM `Modalidad`
SELECT *
FROM `Carrera`
---
    public function index()
    {
        $data['modalidades'] = $this->modalidadModel->findAll();
        $data['carreras'] = $this->carreraModel->findAll();