app/Models/AdministradorModel.php

    public function getAdministradores()
    {
        // Construye una consulta SELECT que devuelve todos los administradores.
        return $this->findAll(); // Ejecuta la consulta y devuelve todos los resultados.
---
SELECT *
FROM `Administrador`