app/Models/EstudianteModel.php

    public function getEstudiantesConCarrera()
    {
        // Construye una consulta SELECT que une la tabla 'Estudiante' con 'Carrera'.
        return $this->select('Estudiante.*, Carrera.nombre_carrera')
            ->join('Carrera', 'Carrera.id = Estudiante.carrera_id', 'left') // 'left' join para incluir estudiantes sin carrera.
            ->findAll(); // Ejecuta la consulta y devuelve todos los resultados.
---
SELECT `Estudiante`.*, `Carrera`.`nombre_carrera`
FROM `Estudiante`
LEFT JOIN `Carrera` ON `Carrera`.`id` = `Estudiante`.`carrera_id`

    public function getEstudianteConCarrera($id)
    {
        // Construye la misma consulta que el método anterior, pero para un solo registro.
        return $this->select('Estudiante.*, Carrera.nombre_carrera')
            ->join('Carrera', 'Carrera.id = Estudiante.carrera_id', 'left')
            ->find($id); // Ejecuta la consulta y devuelve solo el registro que coincide con el ID.
---
SELECT `Estudiante`.*, `Carrera`.`nombre_carrera`
FROM `Estudiante`
LEFT JOIN `Carrera` ON `Carrera`.`id` = `Estudiante`.`carrera_id`
WHERE `Estudiante`.`id` = 1

    public function getNotas($id_est)
    {
        return $this->db->table('Nota')
            ->select('Nota.*, Materia.nombre_materia')
            ->join('Materia', 'Materia.id = Nota.materia_id')
            ->where('Nota.estudiante_id', $id_est)
            ->get()
            ->getResultArray();
---
SELECT `Nota`.*, `Materia`.`nombre_materia`
FROM `Nota`
JOIN `Materia` ON `Materia`.`id` = `Nota`.`materia_id`
WHERE `Nota`.`estudiante_id` = 1

    public function getMateriasInscritas($id_est)
    {
        return $this->db->table('Inscripcion')
            ->select('Inscripcion.*, Materia.nombre_materia, Materia.codigo_materia, Materia.id as materia_id')
            ->join('Materia', 'Materia.id = Inscripcion.materia_id')
            ->where('Inscripcion.estudiante_id', $id_est)
            ->get()
            ->getResultArray();
---
SELECT `Inscripcion`.*, `Materia`.`nombre_materia`, `Materia`.`codigo_materia`, `Materia`.`id` as `materia_id`
FROM `Inscripcion`
JOIN `Materia` ON `Materia`.`id` = `Inscripcion`.`materia_id`
WHERE `Inscripcion`.`estudiante_id` = 1