app/Models/ProfesorModel.php

SELECT *
FROM `Profesor`
---
    public function getProfesores()
    {
        // Construye una consulta SELECT que devuelve todos los profesores.
        return $this->findAll(); // Ejecuta la consulta y devuelve todos los resultados.

SELECT `Profesor`.*, `Carrera`.`nombre_carrera`
FROM `Profesor`
LEFT JOIN `Carrera` ON `Carrera`.`id` = `Profesor`.`carrera_id`
WHERE `Profesor`.`id` = 1
---
    public function getProfesorConCarrera($id)
    {
        // Construye la consulta para un solo registro con join a Carrera.
        return $this->select('Profesor.*, Carrera.nombre_carrera')
            ->join('Carrera', 'Carrera.id = Profesor.carrera_id', 'left')
            ->find($id); // Ejecuta la consulta y devuelve el registro que coincide con el ID.

SELECT `Materia`.`nombre_materia`, `Materia`.`codigo_materia`, `Materia`.`id` as `materia_id`
FROM `Profesor_Materia`
JOIN `Materia` ON `Materia`.`id` = `Profesor_Materia`.`materia_id`
WHERE `Profesor_Materia`.`profesor_id` = 1
---
    public function getMateriasDictadas($id_prof)
    {
        return $this->db->table('Profesor_Materia')
            ->select('Materia.nombre_materia, Materia.codigo_materia, Materia.id as materia_id')
            ->join('Materia', 'Materia.id = Profesor_Materia.materia_id')
            ->where('Profesor_Materia.profesor_id', $id_prof)
            ->get()
            ->getResultArray();

SELECT AVG(calificacion) as promedio
FROM `Nota`
JOIN `Materia` ON `Materia`.`id` = `Nota`.`materia_id`
JOIN `Profesor_Materia` ON `Profesor_Materia`.`materia_id` = `Materia`.`id`
WHERE `Profesor_Materia`.`profesor_id` = 1
---
    public function getEstadisticas($id_prof)
    {
        $materias = $this->getMateriasDictadas($id_prof);
        $total_materias = count($materias);

        $total_estudiantes = 0;
        foreach ($materias as $materia) {
            $estudiantes = $this->db->table('Inscripcion')
                ->where('materia_id', $materia['materia_id'])
                ->countAllResults();
            $total_estudiantes += $estudiantes;
        }

        // Promedio de calificaciones dadas (opcional, si hay notas)
        $notas = $this->db->table('Nota')
            ->select('AVG(calificacion) as promedio')
            ->join('Materia', 'Materia.id = Nota.materia_id')
            ->join('Profesor_Materia', 'Profesor_Materia.materia_id = Materia.id')
            ->where('Profesor_Materia.profesor_id', $id_prof)
            ->get()
            ->getRowArray();